app/views/projectusers/index.html.erb


        <td><%= Project.find(projectuser.project_id).projectname %></td>
        <td><%= User.find(projectuser.user_id).username %></td>
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1