app/views/projectusers/show.html.erb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
---
  <strong>Project:</strong>
  <%= Project.find(@projectuser.project_id).projectname %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  <strong>User:</strong>
  <%= User.find(@projectuser.user_id).username %>