app/controllers/projects_controller.rb

  def index
     @projects = Project.search(params[:search]).order("id").page(params[:page]).per(10)
---
SELECT COUNT(*) FROM `projects` WHERE (projectname LIKE '%ARUBA_23456_ho_ko%')
SELECT `projects`.* FROM `projects` WHERE (projectname LIKE '%ARUBA_23456_ho_ko%') ORDER BY id LIMIT 10 OFFSET 0

  def new
    @project = Project.new
    @all_users = User.all
---
SELECT `users`.* FROM `users`

  def edit
    @project = Project.find(params[:id])
    @all_users = User.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`

  def create
    @project = Project.new(project_params)

    params[:users][:id].each do |user|
      if !user.empty?
          @project.projectusers.build(:user_id => user)
       end
    end
    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`created_at`, `projectname`, `updated_at`) VALUES ('2014-10-14 06:09:24', 'ARUBA_23456_ho_ko', '2014-10-14 06:09:24')

    def set_project
      @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE (projectname LIKE '%#{params[:search]}%')