app/controllers/projectusers_controller.rb

  def index
    @projectusers = Projectuser.order("id").page(params[:page]).per(25)
---
SELECT COUNT(*) FROM `projectusers`
SELECT `projectusers`.* FROM `projectusers` ORDER BY id LIMIT 25 OFFSET 0

  def new
    @projectuser = Projectuser.new
    @all_users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @projectuser = Projectuser.new(projectuser_params)

    respond_to do |format|
      if @projectuser.save
---
INSERT INTO `projectusers` (`created_at`, `project_id`, `updated_at`, `user_id`) VALUES ('2014-10-14 06:14:20', 5, '2014-10-14 06:14:20', 2)

    def set_projectuser
      @projectuser = Projectuser.find(params[:id])
---
SELECT `projectusers`.* FROM `projectusers` WHERE `projectusers`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1