app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY id LIMIT 25 OFFSET 0
---
  def index
    @users = User.order("id").page(params[:page]).per(25)

INSERT INTO `users` (`created_at`, `email`, `firstname`, `lastname`, `updated_at`, `username`) VALUES ('2014-10-14 06:10:29', 'a.alaul', 'alaul', 'hossain', '2014-10-14 06:10:29', 'a.alaul')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save